Documents/ПутевойЛист_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПутевойЛист_2</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыАптека</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыВодитель</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьКонтрагентов</Name>
					<Comment>Если ИСТИНА то при сохранении будет объединять контрагентов в один документ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументПрихода</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеСФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФНомерСчетфактуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКонтрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФКомментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратнаяСФ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратнаяСчетФактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РегТарыПоШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегТарыПоШК</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаКом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тара</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗонаОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗонаОтгрузки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКоробок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерМестаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПутевойЛист_2/Ext/ObjectModule.bsl
Процедура ПечатьПутевогоЛиста(ТабличныйДокумент) Экспорт
	Макет = ЭтотОбъект.ПолучитьМакет("МакетПутевойЛист");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Номер = Номер;
	Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	Область.Параметры.Водитель = Водитель;
	Область.Параметры.Автомобиль = Автомобиль;
	
	//****************ШТРИХКОД********************************
	КартинкаШтрихкода =ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(ЭтотОбъект.СформироватьШК(), 50, 45);
	//КартинкаШтрихкода2 = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(ЭтотОбъект.СформироватьШК(),100,90);
	Если НЕ КартинкаШтрихкода = Неопределено Тогда
		Рисунок				= Область.Область("ШК1");
		Рисунок.Картинка	= КартинкаШтрихкода;
		//Рисунок				= Область.Область("ШК2");
		//Рисунок.Картинка	= КартинкаШтрихкода2;
	КонецЕсли; 	
	//********************************************************
	//****************ШТРИХКОД ВОДИТЕЛЬ ********************************
	КартинкаШтрихкода =ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(СокрЛП(ЭтотОбъект.Водитель.Штрихкод), 50, 45);
	Если НЕ КартинкаШтрихкода = Неопределено Тогда
		Рисунок				= Область.Область("ШКВодитель");
		Рисунок.Картинка	= КартинкаШтрихкода;
	КонецЕсли; 	
	//********************************************************
	
	
	
	ТабличныйДокумент.Вывести(Область);
	
	НомерПП = 1;
	
	//Группируем БЯС
	ТЗБяс=Данные.Выгрузить();
	ТЗБяс.Свернуть("ДокументПрихода");
	
	КолКоробок=0;
	ВесИтог=0;
	ОбъемИтог=0;
	Для Каждого ТекСтрока Из ТЗБяс Цикл
		
		ДокБяс=ТекСтрока.ДокументПрихода;
		//Определяем дату СчетФактуры
		Попытка
			СтрокаДок=ДокБяс.ДокументыРасхода[0].ДатаДокумента;
			ДатаСФ=Формат(СтрокаДок, "ДФ=dd.MM.yyyy");;		
		Исключение
			ДатаСФ="";
		КонецПопытки;
		//Считаем Кол-во СчетФ И выбираем область
		ДлинаСтрСФ=СтрДлина(ДокБяс.НомераСФ);
		Если ДлинаСтрСФ<30 Тогда
			Область = Макет.ПолучитьОбласть("Контрагент");
		Иначе
			Область = Макет.ПолучитьОбласть("Контрагент1");
		КонецЕсли;
		Область.Параметры.НомерПП			= НомерПП;
		Область.Параметры.Контрагент 		= ДокБяс.Получатель;
		//Область.Параметры.МестоОтгрузки		= ТекСтрока.МестоОтгрузки;
		Область.Параметры.Вес				= Окр(ДокБяс.ОбщийВес,5);
		Область.Параметры.Объем				= Окр(ДокБяс.ОбщийОбъем,5);
		Область.Параметры.КоличествоКоробок	= ДокБяс.Коробки;
		Область.Параметры.Комментарий = СокрЛП(ДокБяс.Комментарий);
		Область.Параметры.СчетФактуры = ДокБяс.НомераСФ;
		Область.Параметры.ДатаСФ = ДатаСФ;
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		               |	РегТарыПоШКСрезПоследних.Тара
		               |ИЗ
		               |	РегистрСведений.РегТарыПоШК.СрезПоследних(&Дата, ) КАК РегТарыПоШКСрезПоследних
		               |ГДЕ
		               |	РегТарыПоШКСрезПоследних.Кому = &Кому
		               |	И РегТарыПоШКСрезПоследних.НаКом = &НаКом";
		
		Зап.УстановитьПараметр("Кому",ДокБяс.Получатель );
		Зап.УстановитьПараметр("НаКом","На Аптеке");
		Зап.УстановитьПараметр("Дата",Дата-1);
		
		Рез = Зап.Выполнить();
		Выб = Рез.Выбрать();
		Остаток=Выб.Количество();
		 Если ДокБяс.ЭтоКомплект Тогда
		 	КолТара=0;
		 	Для каждого Стр Из ДокБяс.ДокументыКомплекта Цикл
		    	 КолТара=КолТара+Стр.ДокБЯС.Тара.Количество();
		 	КонецЦикла;
		  //Область.Параметры.ТСдал =КолТара ;
		  //Область.Параметры.ТЗабрать =Остаток;
		 Иначе
		  //Область.Параметры.ТСдал =ДокБяс.Тара.Количество() ;
		  //Область.Параметры.ТЗабрать =Остаток;
		  //
		 КонецЕсли;	 
		
		Подразделение = ДокБяс.Организация;
		
		Если Лев(Подразделение, 1) = "A" Тогда
			Область.Параметры.Подразделение = "А";	
		ИначеЕсли Лев(Подразделение, 1) = "D" Тогда
			Область.Параметры.Подразделение = "D";	
		Иначе
			Область.Параметры.Подразделение = "Н";
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область);
		НомерПП = НомерПП + 1;
		КолКоробок=КолКоробок+ДокБяс.Коробки;
		ВесИтог=ВесИтог+Окр(ДокБяс.ОбщийВес,5);
		ОбъемИтог=ОбъемИтог+Окр(ДокБяс.ОбщийОбъем,5);

	КонецЦикла;
	
	//Дополняем до 25 строк - Минус количество Возвратных СФ
	КолВозвратныхСФ=0;
	Если ВозвратныеСФ.Количество()>0 тогда
		КолВозвратныхСФ=ВозвратныеСФ.Количество()+1;// +1 Для заголовка
	КонецЕсли;
	КолСтрокВОтгрузке=25-КолВозвратныхСФ;
	Пока НомерПП<=КолСтрокВОтгрузке Цикл 
		Область = Макет.ПолучитьОбласть("Контрагент");
		Область.Параметры.НомерПП			= НомерПП;
		ТабличныйДокумент.Вывести(Область);
		НомерПП = НомерПП + 1;
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итог");
	Область.Параметры.КоличествоКоробок=КолКоробок;
	Область.Параметры.Вес=ВесИтог;
	Область.Параметры.Объем=ОбъемИтог;
	ТабличныйДокумент.Вывести(Область);	
	//------------- ВОЗВРАТНЫЕ СЧЕТ ФАКТУРЫ --------------------//
	   Если ВозвратныеСФ.Количество()>0 тогда
		   //Группируем по клиентам
		   ТЗвсф=Новый ТаблицаЗначений;
		   ТЗвсф.Колонки.Добавить("НомерСчетфактуры");
		   ТЗвсф.Колонки.Добавить("Дата");
		   ТЗвсф.Колонки.Добавить("Комментарий");
		   ТЗвсф.Колонки.Добавить("Контрагент");
		   //Заполняем ТЗвсф
		   Для Каждого стр_ВозвратныеСФ Из ВозвратныеСФ Цикл
			   новаяСтрока=ТЗвсф.Добавить();
			   новаяСтрока.НомерСчетфактуры = стр_ВозвратныеСФ.ВозвратнаяСФ.НомерСчетфактуры;
			   новаяСтрока.Дата = Лев(стр_ВозвратныеСФ.ВозвратнаяСФ.Дата,10);
			   новаяСтрока.Комментарий= стр_ВозвратныеСФ.ВозвратнаяСФ.Комментарий;
			   новаяСтрока.Контрагент= стр_ВозвратныеСФ.ВозвратнаяСФ.Контрагент;
			   
		   КонецЦикла;
		   
		   ТЗклиентыВСФ=ТЗвсф.Скопировать();
		   ТЗклиентыВСФ.Свернуть("Контрагент");
		   ТЗклиентыВСФ.Сортировать("Контрагент");
		   
		   // Выводим Заголовок
		   
		   
		   Область=Макет.ПолучитьОбласть("ЗаголовокВозвратнаяСФ");
			 ТабличныйДокумент.Вывести(Область);
			 НомерПП=1;
		   Для Каждого стр_ТЗклиентыВСФ Из ТЗклиентыВСФ Цикл
		   Область=Макет.ПолучитьОбласть("ВозвратнаяСФ");
		   Область.Параметры.Контрагент= стр_ТЗклиентыВСФ.Контрагент;

		   //Счета Фактуры
		   Отбор =Новый Структура;
		   Отбор.Вставить("Контрагент",стр_ТЗклиентыВСФ.Контрагент);
		   ТЗклиентСФ=ТЗвсф.Скопировать(Отбор);
		   НомераСФ="";
		   Для Каждого стр_ТЗклиентСФ Из ТЗклиентСФ Цикл
			  НомераСФ=НомераСФ + " " +  стр_ТЗклиентСФ.НомерСчетфактуры;
			  ДатаВСФ=стр_ТЗклиентСФ.Дата;
		   КонецЦикла;
		   
		   Область.Параметры.СчетФактуры = НомераСФ;
		    Область.Параметры.ДатаСФ = Лев(ДатаВСФ,10);
		   //Комментарии
			ТЗкомментарии=ТЗклиентСФ.Скопировать();
			ТЗкомментарии.Свернуть("Комментарий");
			Комментарий="";
			Для Каждого стр_ТЗкомментарии Из ТЗкомментарии Цикл
			  Комментарий=Комментарий + " " +  стр_ТЗкомментарии.Комментарий;
		   	КонецЦикла;

			
			Область.Параметры.Комментарий= Комментарий;
			
			Область.Параметры.НомерПП			= НомерПП;
			Область.Параметры.Подразделение = "Н";
			ТабличныйДокумент.Вывести(Область);
			НомерПП = НомерПП + 1;
			КонецЦикла;
	   КонецЕсли;
	//----------------------------------------------------------// 
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(Область);	
КонецПроцедуры

Функция СформироватьШК() Экспорт
	Возврат (Справочники.ПрефиксыОбъектовДляШтрихкодов.ПутевойЛист.Наименование+ЭтотОбъект.Номер);
КонецФункции


Процедура ПечатьКонтрольногоЛиста(ТабличныйДокумент) Экспорт
	Макет = ЭтотОбъект.ПолучитьМакет("МакетКонтрольныйЛист");
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Номер = Номер;
	Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	Область.Параметры.Водитель = Водитель;
	//Область.Параметры.Автомобиль = Автомобиль;
	
	//****************ШТРИХКОД********************************
	КартинкаШтрихкода =ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(СокрЛП(ЭтотОбъект.СформироватьШК()), 50, 45);
	//КартинкаШтрихкода2 = ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(ЭтотОбъект.СформироватьШК(),100,90);
	Если НЕ КартинкаШтрихкода = Неопределено Тогда
		Рисунок				= Область.Область("ШК1");
		Рисунок.Картинка	= КартинкаШтрихкода;
		//Рисунок				= Область.Область("ШК2");
		//Рисунок.Картинка	= КартинкаШтрихкода2;
	КонецЕсли; 	
	//********************************************************
	//****************ШТРИХКОД ВОДИТЕЛЬ ********************************
	КартинкаШтрихкода =ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(СокрЛП(ЭтотОбъект.Водитель.Штрихкод), 50, 45);
	Если НЕ КартинкаШтрихкода = Неопределено Тогда
		Рисунок				= Область.Область("ШКВодитель");
		Рисунок.Картинка	= КартинкаШтрихкода;
	КонецЕсли; 	
	//********************************************************
	
	
	
	
	ТабличныйДокумент.Вывести(Область);
	
	НомерПП = 1;
	//Группируем БЯС
	ТЗБяс=Данные.Выгрузить();
	ТЗБяс.Свернуть("ДокументПрихода");
	
	КолКоробок=0;
	
//++++++++++++++++ ОТЛАДКА ++++++++++++++//	
//	Возврат;	
//++++++++++++++++ ОТЛАДКА ++++++++++++++//	
	// Сообщить(ТЗБяс.Количество());

	Для Каждого ТекСтрока Из ТЗБяс Цикл
		
		ДокБяс=ТекСтрока.ДокументПрихода;
		//Сообщить(ДокБяс);
		//Определяем дату СчетФактуры
		Попытка
			СтрокаДок=ДокБяс.ДокументыРасхода[0].Док;
			ДатаСФ=Лев(Прав(СтрокаДок,18),10);		
		Исключение
			ДатаСФ="";
		КонецПопытки;
		//Считаем Кол-во СчетФ И выбираем область
		//ДлинаСтрСФ=СтрДлина(ДокБяс.НомераСФ);
		//Если ДлинаСтрСФ<30 Тогда
		Область = Макет.ПолучитьОбласть("Контрагент");
		//Иначе
		//Область = Макет.ПолучитьОбласть("Контрагент1");
		//КонецЕсли;
		Область.Параметры.НомерПП			= НомерПП;
		Область.Параметры.Контрагент 		= ДокБяс.Получатель;
		Область.Параметры.МестаОтгрузки		= ТекСтрока.ДокументПрихода.СписокМестХранений;
		//Область.Параметры.Вес				= ДокБяс.ОбщийВес;
		//Область.Параметры.Объем				= ДокБяс.ОбщийОбъем;
		Область.Параметры.КоличествоКоробок	= ДокБяс.Коробки;
		//Область.Параметры.Комментарий = СокрЛП(ДокБяс.Комментарий);
		Область.Параметры.СчетФактуры = ДокБяс.НомераСФ;
		//Область.Параметры.ДатаСФ = ДатаСФ;
		
		Подразделение = ДокБяс.Организация;
		
		Если Лев(Подразделение, 1) = "А" Тогда
			Область.Параметры.Подразделение = "А";	
		Иначе
			Область.Параметры.Подразделение = "Н";
		КонецЕсли;
		
		//Получаем ШК Сборки
		ШКСборки=СокрЛП(ДокБяс.ДокументыРасхода[0].ШК);
		//**************** ШТРИХКОД СБОРКИ ***************************
		Если ШКСборки<>"Нет в Дельфи." И ШКСборки<>"" Тогда
		КартинкаШтрихкода =ОбщийМодуль_Каштан.ПолучитьКартинкуШтрихкода(СокрЛП(ШКСборки), 50, 45,Ложь);
		Если НЕ КартинкаШтрихкода = Неопределено Тогда
			Рисунок				= Область.Область("ШКСборки");
			Рисунок.Картинка	= КартинкаШтрихкода;
		КонецЕсли; 	
		КонецЕсли;
		//********************************************************
		
		
		ТабличныйДокумент.Вывести(Область);
		НомерПП = НомерПП + 1;
		КолКоробок=КолКоробок+ДокБяс.Коробки;
	КонецЦикла;
	
	//Дополняем до 25 строк
	//Пока НомерПП<=25 Цикл 
	//	Область = Макет.ПолучитьОбласть("Контрагент");
	//	Область.Параметры.НомерПП			= НомерПП;
	//	ТабличныйДокумент.Вывести(Область);
	//	НомерПП = НомерПП + 1;
	//	
	//КонецЦикла;
	
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.КоличествоКоробок	= КолКоробок;
	//Область.Параметры.Вес				= Данные.Итог("Вес");
	//Область.Параметры.Объем				= Данные.Итог("Объем");
	ТабличныйДокумент.Вывести(Область);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
		
	
	//Проставляем Кол мест
	Кол=0;
	Для Каждого стр_Данные Из Данные Цикл
		Кол=Кол+стр_Данные.ДокументПрихода.Коробки;
	КонецЦикла;
	КоличествоМест=Кол;
	//************ Проставляем Ссылки в БЯС Если Нужно ******************//
	Для Каждого стр_Данные Из Данные Цикл   // Если не заполнено поле Путевой Лист
		
		ДокБЯСссылка=стр_Данные.ДокументПрихода;
		Если Не ЗначениеЗаполнено(ДокБЯСссылка.ПутевойЛист) Тогда
			ДокБяс=ДокБЯСссылка.ПолучитьОбъект();
			ДокБяс.ПутевойЛист=Ссылка;
			ДокБяс.Записать();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокБЯСссылка.ПутевойЛист) Тогда    // Если Заполнено но не равно
			Если ДокБЯСссылка.ПутевойЛист<>Ссылка Тогда
				ДокБяс=ДокБЯСссылка.ПолучитьОбъект();
				ДокБяс.ПутевойЛист=Ссылка;
				ДокБяс.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры
&НаСервере
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.РегТарыПоШК.Записывать = Истина;
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Клиент");
	Для Каждого ТекСтрокаДанные Из Данные Цикл
		Стр=ТЗ.Добавить();
		Стр.Клиент=ТекСтрокаДанные.ДокументПрихода.Получатель;	
		ДокБЯС=ТекСтрокаДанные.ДокументПрихода;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗонаОтгрузкиОстатки.ДокументПрихода,
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток
		|ИЗ
		|	РегистрНакопления.ЗонаОтгрузки.Остатки(, ДокументПрихода = &ДокБЯС) КАК ЗонаОтгрузкиОстатки
		|ГДЕ
		|	ЗонаОтгрузкиОстатки.КоличествоКоробокОстаток > 0";
		
		Запрос.УстановитьПараметр("ДокБЯС", ДокБЯС);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			
			
			//---- Если Остатки Есть - ПРОВОДИМ--//
			//Движения.ЗонаОтгрузки.Записывать	= Истина;
			//Для Каждого ТекСтрока Из ДокБЯС.МестаОтгрузки Цикл
			//	
			//	Движение = Движения.ЗонаОтгрузки.Добавить();
			//	Движение.ВидДвижения		= ВидДвиженияНакопления.Расход;
			//	Движение.Период				= Дата;
			//	Движение.ДокументПрихода	= ДокБЯС;
			//	Движение.НомерМестаОтгрузки	= ТекСтрока.МестоОтгрузки;
			//	Движение.КоличествоКоробок	= ТекСтрока.КоличествоКоробок;
			//	//Движение.Вес				= ТекСтрока.Вес;
			//	//Движение.Объем				= ТекСтрока.Объем;
			//	
			//КонецЦикла;
			
			
		КонецЕсли;

	КонецЦикла;
	ТЗ.Свернуть("Клиент");
	Для Каждого ТекСтрокаДанные Из ТЗ Цикл
		Клиент=ТекСтрокаДанные.Клиент;	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегТарыПоШКСрезПоследних.Период,
		               |	РегТарыПоШКСрезПоследних.Тара,
		               |	РегТарыПоШКСрезПоследних.Кому,
		               |	РегТарыПоШКСрезПоследних.НаКом
		               |ИЗ
		               |	РегистрСведений.РегТарыПоШК.СрезПоследних(&Дата, ) КАК РегТарыПоШКСрезПоследних
		               |ГДЕ
		               |	РегТарыПоШКСрезПоследних.Кому = &Кому
		               |	И РегТарыПоШКСрезПоследних.НаКом = &НаКом";
		
		Запрос.УстановитьПараметр("Кому",Клиент );
		Запрос.УстановитьПараметр("НаКом","На Аптеке");
		Запрос.УстановитьПараметр("Дата",Дата-1);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		    Движение=Движения.РегТарыПоШК.Добавить();
			Движение.Период=Дата;
			Движение.Тара=Выборка.Тара;
			Движение.Кому=Клиент;
			Движение.НаКом=Водитель ;
			Движение.Причина="Должен забрать" ;
		КонецЦикла;
		
	КонецЦикла;
	Попытка
		//ВыгрузкаДок(Ссылка);
		ТМС.ОтправитьМЛ(Ссылка);
	Исключение
	КонецПопытки;

КонецПроцедуры
Функция ВыгрузкаДок(ДокСсылка) Экспорт
	   СтрокаСоединения=Константы.СтрокаСоединенияСБазойТМС.Получить();
	   V8=New COMОбъект("V83.COMConnector");
	   //ДокОбъект=ДокСсылка.ПолучитьОбъект();
	   
		conn=V8.Connect(СтрокаСоединения);
		   ДокПоиск=conn.Документы.ПутевойЛист_2.НайтиПоНомеру(Номер,Дата);
		   Если ДокПоиск<>conn.Документы.ПутевойЛист_2.ПустаяСсылка() Тогда
			   НовыйДок=ДокПоиск.ПолучитьОбъект();
		   Иначе	
			   НовыйДок=conn.Документы.ПутевойЛист_2.СоздатьДокумент();
			   НовыйДок.Номер=Номер;
		   КонецЕсли;
		   //ПоискКонтрагента=conn.Справочники.упКонтрагенты.НайтиПоКоду(ДокСсылкаПолучатель.Код);
		   //Если ПоискКонтрагента<>conn.Справочники.Контрагенты.ПустаяСсылка() Тогда
		   //    Контрагент=ПоискКонтрагента;
		   //Иначе
		   //    Возврат 0; 
		   //КонецЕсли;
		   НовыйДок.Дата=Дата;
		   НовыйДок.Водитель=conn.Справочники.упСотрудники.НайтиПоРеквизиту("МобТелефон",Водитель.Телефон);
		   
		   //НовыйДок.Водитель=Водитель;
		   //НовыйДок.Автомобиль=Автомобиль;
		   //НовыйДок.КоличествоМест=Автомобиль;
		   
		   НовыйДок.Данные.Очистить();
		   Для Каждого СтрокаТЧ Из Данные Цикл
			   НоваяСтрокаТЧ=НовыйДок.Данные.Добавить();
			   НоваяСтрокаТЧ.Клиент=conn.Справочники.упКонтрагенты.НайтиПоКоду(СтрЗаменить(СтрокаТЧ.ДокументПрихода.Получатель.Код,"ХЗ",""));
			   НоваяСтрокаТЧ.НомераСФ=СтрокаТЧ.ДокументПрихода.НомераСФ;
			   
		   КонецЦикла;
		   НовыйДок.Записать(conn.РежимЗаписиДокумента.Проведение);
		   Возврат Истина;
   КонецФункции
